In [1]:
import pandas as pd
import numpy as np

In [2]:
import kagglehub

# Download latest version
path = kagglehub.dataset_download("cynthycynthy/titanicdataset")

print("Path to dataset files:", path)

/Users/gabrielmata/Desktop/Pandas fundamentals/.venv/lib/python3.13/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

Downloading from https://www.kaggle.com/api/v1/datasets/download/cynthycynthy/titanicdataset?dataset_version_number=1...

100%|██████████| 1.03k/1.03k [00:00<00:00, 916kB/s]

Extracting files...
Path to dataset files: /Users/gabrielmata/.cache/kagglehub/datasets/cynthycynthy/titanicdataset/versions/1

In [ ]:
# leer el archivo csv descargado
# Use the path variable to read the CSV file

TypeError: unsupported operand type(s) for /: 'str' and 'str'

In [6]:
df0 = pd.read_csv('titanic.csv')

In [ ]:
df0.head(10)

NameError: name 'df0' is not defined

In [13]:
df0.shape

(891, 12)

In [ ]:
# Display the DataFrame information
# This will show the number of entries, columns, and data types
df0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [17]:
# extraer edad, genero y clase de pasajero
df0[['Age', 'Sex', 'Pclass']]

      Age     Sex  Pclass
0    22.0    male       3
1    38.0  female       1
2    26.0  female       3
3    35.0  female       1
4    35.0    male       3
..    ...     ...     ...
886  27.0    male       2
887  19.0  female       1
888   NaN  female       3
889  26.0    male       1
890  32.0    male       3

[891 rows x 3 columns]

In [19]:
df_edad_sexo_pclass = df0[['Age','Sex','Pclass']]

In [20]:
df_edad_sexo_pclass.describe()

              Age      Pclass
count  714.000000  891.000000
mean    29.699118    2.308642
std     14.526497    0.836071
min      0.420000    1.000000
25%     20.125000    2.000000
50%     28.000000    3.000000
75%     38.000000    3.000000
max     80.000000    3.000000

In [23]:
# Filtrar los pasajeros mayores de 30 años
# This will create a new DataFrame with only those passengers
# whose 'Age' is greater than 30
above_30 = df_edad_sexo_pclass[df_edad_sexo_pclass['Age'] >= 30]
print(above_30)

      Age     Sex  Pclass
1    38.0  female       1
3    35.0  female       1
4    35.0    male       3
6    54.0    male       1
11   58.0  female       1
..    ...     ...     ...
873  47.0    male       3
879  56.0  female       1
881  33.0    male       3
885  39.0  female       3
890  32.0    male       3

[330 rows x 3 columns]

In [25]:
# mayores de 30 años y sexo femenino
above_30_f = df_edad_sexo_pclass[(df_edad_sexo_pclass['Age'] > 30) & (df_edad_sexo_pclass['Sex'] == 'female')]
print(above_30_f)

      Age     Sex  Pclass
1    38.0  female       1
3    35.0  female       1
11   58.0  female       1
15   55.0  female       2
18   31.0  female       3
..    ...     ...     ...
862  48.0  female       1
865  42.0  female       2
871  47.0  female       1
879  56.0  female       1
885  39.0  female       3

[103 rows x 3 columns]

In [28]:
# muestrame los valores unicos de la columna Sex
df_edad_sexo_pclass['Sex'].unique()

array(['male', 'female'], dtype=object)

In [29]:
above_30_f['Sex'].unique()

array(['female'], dtype=object)